Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པ་འམ་མི་གནས་པ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: If you ask why, Subhūti, in the essential nature of knowledge of the path there is neither resting nor nonresting, and in the essential nature of all-aspect omniscience there is neither resting nor nonresting.

source: རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད། ལམ་གྱི་རྣམ་པ་ཤེས་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་བའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: If you ask why, Subhūti, it is because the essential nature of knowledge of the path is empty of the essential nature of knowledge of the path, and the essential nature of all-aspect omniscience is empty of the essential nature of all-aspect omniscience. “

source: མིང་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། མཚན་མ་དང་།
en: Subhūti, just as names neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: བརྡ་དང་། ཐ་སྙད་དང་། གདགས་པ་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ།
en: Subhūti, just as signs, symbols, conventional expressions, and designations neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་མིང་གི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ། །མཚན་མ་དང་། བརྡ་དང་། ཐ་སྙད་དང་། གདགས་པའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: If you ask why, Subhūti, in the essential nature of names there is neither resting nor nonresting, and in the essential natures of signs, symbols, conventional expressions, and designations there is neither resting nor nonresting.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་མིང་གི་ངོ་བོ་ཉིད་མིང་གི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །མཚན་མའི་ངོ་བོ་ཉིད་མཚན་མའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །བརྡའི་ངོ་བོ་ཉིད། བརྡའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །ཐ་སྙད་ཀྱི་ངོ་བོ་ཉིད། ཐ་སྙད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །གདགས་པའི་ངོ་བོ་ཉིད། གདགས་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: If you ask why, Subhūti, it is because the essential nature of names is empty of the essential nature of names, ] the essential nature of signs is empty of the essential nature of signs, the essential nature of symbols is empty of the essential nature of symbols, the essential nature of conventional expressions is empty of the essential nature of conventional expressions, and the essential nature of designations is empty of the essential nature of designations. “

source: སྐྱེ་བ་མེད་པ་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Subhūti, just as nonarising neither comes to rest, nor does it not come to rest, similarly, this Great Vehicle does not come to rest, nor does it not come to rest.

source: འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན།
en: Subhūti, just as noncessation, nonaffliction, and nonpurification neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སྐྱེ་བ་མེད་པའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ། །འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་།
en: If you ask why, Subhūti, in the essential nature of nonarising there is neither resting nor nonresting, and in the essential natures of noncessation, nonaffliction, and nonpurification there is neither resting nor nonresting.

source: རྣམ་པར་བྱང་བ་མེད་པའི་ངོ་བོ་ཉིད་ལ་གནས་པའམ་མི་གནས་པ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་སྐྱེ་བ་མེད་པའི་ངོ་བོ་ཉིད་སྐྱེ་བ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །འགག་པ་མེད་པའི་ངོ་བོ་ཉིད་འགག་པ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའི་ངོ་བོ་ཉིད་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །རྣམ་པར་བྱང་བ་མེད་པའི་ངོ་བོ་ཉིད་རྣམ་པར་བྱང་བ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ།
en: If you ask why, Subhūti, it is because the essential nature of nonarising is empty of the essential nature of nonarising, the essential nature of nonceasing is empty of the essential nature of nonceasing, the essential nature of nonaffliction is empty of the essential nature of nonaffliction, and the essential nature of nonpurification is empty of the essential nature of nonpurification. “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Subhūti, just as nonconditioning neither comes to rest, nor does it not come to rest, similarly, this Great Vehicle does not come to rest, nor does it not come to rest.

source: རབ་འབྱོར་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པ་འམ་མི་གནས་པ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: If you ask why, Subhūti, in the essential nature of nonconditioning there is neither resting nor nonresting.

source: རབ་འབྱོར་དེ་ནི་འདི་ལྟར་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་ངོ་བོ་ཉིད་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ།
en: If you ask why, Subhūti, it is because the essential nature of nonconditioning is empty of the essential nature of nonconditioning.

source: །རབ་འབྱོར་རྣམ་གྲངས་དེས་ན། ཐེག་པ་ཆེན་པོ་དེ་ནི་མི་གནས་པར་གནས་པའི་ཚུལ་དང་། བསྐྱོད་དུ་མེད་པའི་ཚུལ་གྱིས་གང་དུ་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: Subhūti, those are the formulations explaining how, since it rests in nonresting and is immovable, this Great Vehicle will not come to rest anywhere. “

source: །རབ་འབྱོར་གང་ཡང་ཁྱོད་ཀྱིས་འདི་སྐད་དུ་ཐེག་པ་དེས་སུ་ཞིག་འབྱུང་བར་འགྱུར་ཞེས་སྨྲས་པ་ནི།
en: Also, Subhūti, you asked who will attain emancipation by means of this vehicle.

source: ཐེག་པ་དེས་སུ་ཡང་འབྱུང་བར་འགྱུར་བ་མེད་དོ།
en: No one will attain emancipation by means of this vehicle.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཐེག་པ་དེ་གང་ཡིན་པ་དང་། གང་འབྱུང་བར་འགྱུར་བ་དང་། གང་གིས་འབྱུང་བར་འགྱུར་བ་དང་། གང་ནས་འབྱུང་བར་འགྱུར་བའི་ཆོས་དེ་དག་ཐམས་ཅད་མེད་ཅིང་མི་དམིགས་པའི་ཕྱིར་ཏེ།
en: If you ask why, Subhūti, it is because all those phenomena that comprise this vehicle, that will attain emancipation, by which emancipation will be attained, and from which emancipation will be attained are nonexistent and they are nonapprehensible.

source: དེ་ལྟར་ཆོས་ཐམས་ཅད་མེད་ཅིང་མི་དམིགས་ན། ཆོས་གང་ཞིག་ཆོས་གང་གིས་འབྱུང་བར་འགྱུར།
en: Since all phenomena are accordingly nonexistent and nonapprehensible, what would attain emancipation by means of what?

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བདག་ཤིན་དུ་རྣམ་པར་དག་པ་དང་། སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོ་ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་རོ།
en: If you ask why, Subhūti, it is because the self is utterly pure, and because sentient beings, life forms, living beings, living creatures, persons, individuals, human beings, people, actors, experiencers, knowers, and viewers are utterly pure.

source: །མཐའ་ལས་འདས་པས་བདག་དམྱིགས་སུ་མེད་དོ། །མཐའ་ལས་འདས་པས་སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་།
en: Since it is beyond limitations, the self is nonapprehensible.

source: ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོ་དམྱིགས་སུ་མེད་དོ།
en: Since they are beyond limitations, sentient beings, life forms, living beings, living creatures, persons, individuals, human beings, people, actors, experiencers, knowers, and viewers are nonapprehensible. “

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། ཆོས་ཀྱི་དབྱིངས་དམྱིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར།
en: The realm of phenomena is nonapprehensible, owing to its utter purity.

source: དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དམྱིགས་སུ་མེད་དོ།
en: The real nature, the very limit of reality, and the inconceivable realm are nonapprehensible, owing to their utter purity.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། ཕུང་པོ་རྣམས་དམྱིགས་སུ་མེད་དོ།
en: The psycho-physical aggregates are nonapprehensible, owing to their utter purity.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། སྐྱེ་མཆེད་དང་། ཁམས་རྣམས་དམྱིགས་སུ་མེད་དོ།
en: The sensory elements and the sense fields are nonapprehensible, owing to their utter purity.

source: ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དམྱིགས་སུ་མེད་དོ།
en: The links of dependent origination are nonapprehensible, owing to their utter purity.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དམྱིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར།
en: The perfection of generosity is nonapprehensible, owing to its utter purity.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམྱིགས་སུ་མེད་དོ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are nonapprehensible, owing to their utter purity.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། ནང་སྟོང་པ་ཉིད་དམྱིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་དམྱིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར།
en: The emptiness of internal phenomena is nonapprehensible, owing to its utter purity, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are nonapprehensible, owing to their utter purity. “

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དམིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། ཡང་དག་པར་སྤོང་བ་དང་།
en: The applications of mindfulness are nonapprehensible, owing to their utter purity.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དམྱིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་།
en: The correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are nonapprehensible, owing to their utter purity.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དམྱིགས་སུ་མེད་དོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are nonapprehensible, owing to their utter purity.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དམྱིགས་སུ་མེད་དོ།
en: The ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are nonapprehensible, owing to their utter purity.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། རྒྱུན་དུ་ཞུགས་པ་དམྱིགས་སུ་མེད་དོ།
en: Those who have entered the stream to nirvāṇa are nonapprehensible, owing to their utter purity.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་དམྱིགས་སུ་མེད་དོ།
en: Those who are destined for only one more rebirth, those who are no longer subject to rebirth, arhats, and pratyekabuddhas are nonapprehensible, owing to their utter purity.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དམྱིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར།
en: Bodhisattvas are nonapprehensible, owing to their utter purity.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དམྱིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར།
en: Those who have become tathāgatas, arhats, completely awakened buddhas are nonapprehensible, owing to their utter purity.

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དམྱིགས་སུ་མེད་དོ།
en: The fruit of having entered the stream to nirvāṇa is nonapprehensible, owing to its utter purity.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དམྱིགས་སུ་མེད་དོ།
en: The fruit of being destined for only one more rebirth, and the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment are nonapprehensible, owing to their utter purity.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དམྱིགས་སུ་མེད་དོ།
en: Knowledge of the path and all-aspect omniscience are nonapprehensible, owing to their utter purity.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། སྐྱེ་བ་མེད་པ་དམྱིགས་སུ་མེད་དོ།
en: Nonarising is nonapprehensible, owing to its utter purity.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དམྱིགས་སུ་མེད་དོ།
en: Noncessation, nonaffliction, nonpurification, and nonconditioning are nonapprehensible, owing to their utter purity.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། སྔོན་གྱི་མཐའ་དམྱིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར།
en: The limit of the past is nonapprehensible, owing to its utter purity.

source: ཕྱི་མའི་མཐའ་དམྱིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར།
en: The limit of the future is nonapprehensible, owing to its utter purity.

source: ད་ལྟར་བྱུང་བ་དམྱིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། འོང་བ་དང་། འགྲོ་བ་དང་།
en: Present events are nonapprehensible, owing to their utter purity.

source: གནས་པ་དང་། འཆི་འཕོ་དང་། སྐྱེ་བ་དང་། འགྲིབ་པ་དང་། འཕེལ་བ་དམྱིགས་སུ་མེད་དོ།
en: Coming, going, abiding, transmigrating at death, birth, decline, and growth are nonapprehensible, owing to their utter purity. “

source: །གང་མི་དམྱིགས་པས་ཐམས་ཅད་དམྱིགས་སུ་མེད་པ་ཡིན་ཞེ་ན།
en: What, you may ask, is it that is not apprehended, on account of which all phenomena are nonapprehensible?

source: ཆོས་ཀྱི་དབྱིངས་མི་དམྱིགས་པས་ཆོས་ཀྱི་དབྱིངས་དམྱིགས་སུ་མེད་དོ།
en: The realm of phenomena is nonapprehensible because the realm of phenomena is not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཆོས་ཀྱི་དབྱིངས་དམྱིགས་སུ་མེད་པ་ནི། དམྱིགས་པ་ཡང་མ་ཡིན། མི་དམྱིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, the nonapprehensible realm of phenomena is neither apprehended, nor is it not apprehended.

source: །དེ་བཞིན་ཉིད་མི་དམྱིགས་པས། དེ་བཞིན་ཉིད་དམྱིགས་སུ་མེད་དོ།
en: The real nature is nonapprehensible because the real nature is not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་ཉིད་དམྱིགས་སུ་མེད་པ་ནི། དམྱིགས་པ་ཡང་མ་ཡིན།
en: If you ask why, Subhūti, the nonapprehensible real nature is neither apprehended, nor is it not apprehended.

source: མི་དམྱིགས་པ་ཡང་མ་ཡིན་ནོ། །ཡང་དག་པའི་མཐའ་མི་དམྱིགས་པས། ཡང་དག་པའི་མཐའ་དམྱིགས་སུ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: The very limit of reality is nonapprehensible because the very limit of reality is not apprehended.

source: རབ་འབྱོར་ཡང་དག་པའི་མཐའ་དམྱིགས་སུ་མེད་པ་ནི། དམྱིགས་པ་ཡང་མ་ཡིན།
en: If you ask why, Subhūti, the nonapprehensible very limit of reality is neither apprehended, nor is it not apprehended.

source: མི་དམྱིགས་པ་ཡང་མ་ཡིན་ནོ། །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མི་དམྱིགས་པས། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དམྱིགས་སུ་མེད་དོ།
en: The inconceivable realm is nonapprehensible because the inconceivable realm is not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དམྱིགས་སུ་མེད་པ་ནི། དམྱིགས་པ་ཡང་མ་ཡིན། མི་དམྱིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, the nonapprehensible inconceivable realm is neither apprehended, nor is it not apprehended. “

source: །ཕུང་པོ་དང་། སྐྱེ་མཆེད་དང་། ཁམས་མི་དམྱིགས་པས། ཕུང་པོ་དང་། སྐྱེ་མཆེད་དང་།
en: The psycho-physical aggregates, sensory elements, and sense fields are nonapprehensible because the psycho-physical aggregates, sensory elements, and sense fields are not apprehended.

source: ཁམས་དམྱིགས་སུ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཕུང་པོ་དང་། སྐྱེ་མཆེད་དང་། ཁམས་དམྱིགས་སུ་མེད་པ་ནི།
en: If you ask why, Subhūti, nonapprehensible psycho-physical aggregates, sensory elements, and sense fields are neither apprehended, nor are they not apprehended.

source: དམྱིགས་པ་ཡང་མ་ཡིན། མི་དམྱིགས་པ་ཡང་མ་ཡིན་ནོ། །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མི་དམྱིགས་པས། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དམྱིགས་སུ་མེད་དོ།
en: The links of dependent origination are nonapprehensible because the links of dependent origination are not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དམྱིགས་སུ་མེད་པ་ནི། དམྱིགས་པ་ཡང་མ་ཡིན། མི་དམྱིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, nonapprehensible links of dependent origination are neither apprehended, nor are they not apprehended.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་དམྱིགས་པས། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དམྱིགས་སུ་མེད་དོ།
en: The perfection of generosity is nonapprehensible because the perfection of generosity is not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དམྱིགས་སུ་མེད་པ་ནི། དམྱིགས་པ་ཡང་མ་ཡིན། མི་དམྱིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, the nonapprehensible perfection of generosity is neither apprehended, nor is it not apprehended.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་དམྱིགས་པས།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are nonapprehensible because the perfection of wisdom [and so forth] are not apprehended.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དམྱིགས་སུ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དམྱིགས་སུ་མེད་པ་ནི། དམྱིགས་པ་ཡང་མ་ཡིན། མི་དམྱིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, the nonapprehensible perfection of wisdom [and so forth] are neither apprehended, nor are they not apprehended.

source: །ནང་སྟོང་པ་ཉིད་མི་དམྱིགས་པས། ནང་སྟོང་པ་ཉིད་དམྱིགས་སུ་མེད་དོ།
en: The emptiness of internal phenomena is nonapprehensible because the emptiness of internal phenomena is not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ནང་སྟོང་པ་ཉིད་དམྱིགས་སུ་མེད་པ་ནི། དམྱིགས་པ་ཡང་མ་ཡིན། མི་དམྱིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, the nonapprehensible emptiness of internal phenomena is neither apprehended, nor is it not apprehended. [

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མི་དམྱིགས་པས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དམྱིགས་སུ་མེད་དོ།
en: The other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are nonapprehensible because the emptiness of the essential nature of nonentities [and so forth] are not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དམྱིགས་སུ་མེད་པ་ནི། དམྱིགས་པ་ཡང་མ་ཡིན། མི་དམྱིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, the nonapprehensible emptiness of the essential nature of nonentities [and so forth] are neither apprehended, nor are they not apprehended. “

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མི་དམྱིགས་པས། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དམྱིགས་སུ་མེད་དོ།
en: The applications of mindfulness are nonapprehensible because the applications of mindfulness are not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དམྱིགས་སུ་མེད་པ་ནི། དམྱིགས་པ་ཡང་མ་ཡིན། མི་དམྱིགས་པ་ཡང་མ་ཡིན་ནོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: If you ask why, Subhūti, the nonapprehensible applications of mindfulness are neither apprehended, nor are they not apprehended.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མི་དམྱིགས་པས།
en: The correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are nonapprehensible because the noble eightfold path [and so forth] are not apprehended.

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དམྱིགས་སུ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དམྱིགས་སུ་མེད་པ་ནི། དམྱིགས་པ་ཡང་མ་ཡིན། མི་དམྱིགས་པ་ཡང་མ་ཡིན་ནོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་།
en: If you ask why, Subhūti, the nonapprehensible noble eightfold path [and so forth] are neither apprehended, nor are they not apprehended.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་མི་དམྱིགས་པས།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are nonapprehensible because the dhāraṇī gateways [and so forth] are not apprehended.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དམྱིགས་སུ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གཟུངས་ཀྱི་སྒོ་རྣམས་དམྱིགས་སུ་མེད་པ་ནི། དམྱིགས་པ་ཡང་མ་ཡིན། མི་དམྱིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, the nonapprehensible dhāraṇī gateways [and so forth] are neither apprehended, nor are they not apprehended.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་མི་དམྱིགས་པས། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དམྱིགས་སུ་མེད་དོ།
en: The ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are nonapprehensible because the eighteen distinct qualities of the buddhas [and so forth] are not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དམྱིགས་སུ་མེད་པ་ནི། དམྱིགས་པ་ཡང་མ་ཡིན། མི་དམྱིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, the nonapprehensible eighteen distinct qualities of the buddhas [and so forth] are neither apprehended, nor are they not apprehended. “

source: །རྒྱུན་དུ་ཞུགས་པ་མི་དམྱིགས་པས། རྒྱུན་དུ་ཞུགས་པ་དམྱིགས་སུ་མེད་དོ།
en: Those who have entered the stream to nirvāṇa are nonapprehensible because those who have entered the stream to nirvāṇa are not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་རྒྱུན་དུ་ཞུགས་པ་དམྱིགས་སུ་མེད་པ་ནི། དམྱིགས་པ་ཡང་མ་ཡིན། མི་དམྱིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, the nonapprehensible individuals who have entered the stream to nirvāṇa are neither apprehended, nor are they not apprehended.

source: ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་མི་དམྱིགས་པས། དགྲ་བཅོམ་པ་དམྱིགས་སུ་མེད་དོ།
en: Those who are destined for only one more rebirth, those who are no longer subject to rebirth, and arhats are nonapprehensible because arhats [and so forth] are not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དགྲ་བཅོམ་པ་དམྱིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, the nonapprehensible arhats [and so forth] are neither apprehended, nor are they not apprehended.

source: །རང་སངས་རྒྱས་མི་དམིགས་པས། རང་སངས་རྒྱས་དམིགས་སུ་མེད་དོ།
en: Pratyekabuddhas are nonapprehensible because pratyekabuddhas are not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་རང་སངས་རྒྱས་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, nonapprehensible pratyekabuddhas are neither apprehended, nor are they not apprehended.
